{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "input_length": 500, "trainable": true, "activity_regularizer": null, "dtype": "int32", "output_dim": 100, "input_dim": 20000, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "embeddings_regularizer": null, "embeddings_constraint": null, "name": "embedding_1", "batch_input_shape": [null, 500]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "filters": 250, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "conv1d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3], "bias_constraint": null, "use_bias": true, "activation": "relu", "dilation_rate": [1], "strides": [1], "trainable": true}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "global_max_pooling1d_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 250, "use_bias": true, "name": "dense_1", "trainable": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 1, "use_bias": true, "name": "dense_2", "trainable": true, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_2"}}], "keras_version": "2.0.4"}