{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "input_length": 500, "input_dim": 20000, "batch_input_shape": [null, 500], "activity_regularizer": null, "embeddings_regularizer": null, "output_dim": 100, "name": "embedding_1", "dtype": "int32", "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "mask_zero": false}}, {"class_name": "GlobalAveragePooling1D", "config": {"trainable": true, "name": "global_average_pooling1d_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "activation": "sigmoid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null}}], "keras_version": "2.0.4"}