{"keras_version": "2.0.4", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "embeddings_regularizer": null, "trainable": true, "dtype": "int32", "embeddings_constraint": null, "output_dim": 32, "name": "embedding_1", "input_dim": 5000, "input_length": 500, "mask_zero": false, "batch_input_shape": [null, 500], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 250, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 1, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null, "bias_constraint": null}}]}